.config/doom/config.org
** Doom
Settings related to fonts within Doom Emacs:
+ 'doom-font' -- standard monospace font that is used for most things in Emacs.
+ 'doom-variable-pitch-font' -- variable font which is useful in some Emacs plugins.
+ 'doom-big-font' -- used in doom-big-font-mode; useful for presentations.
+ 'font-lock-comment-face' -- for comments.
+ 'font-lock-keyword-face' -- for keywords with special significance like 'setq' in elisp.
#+BEGIN_SRC emacs-lisp
(setq doom-font (font-spec :family "JetBrains Mono NF ExtraBold" :size 15) ;; :height 1.1)
      doom-variable-pitch-font (font-spec :family "Ubuntu" :size 15)
      doom-big-font (font-spec :family "JetBrains Mono" :size 24))
(after! doom-themes
  (setq doom-themes-enable-bold t
        doom-themes-enable-italic t))
(custom-set-faces!
  '(font-lock-comment-face :slant italic)
  '(font-lock-keyword-face :slant italic))
#+END_SRC
** Dired
#+begin_src emacs-lisp
;; (defun use-ocr-b-bold ()
;;   "Switch the current buffer to the OCR B-Bold font."
;;   (face-remap-add-relative 'default '(:family "JetBrains Mono NF ExtraBold" :height 130)))

;; (add-hook 'dired-mode-hook 'use-ocr-b-bold)


;; (defun use-jetbrains-mono-extrabold ()
;;   "Switch the current buffer to JetBrains Mono ExtraBold font."
;;   (interactive)
;;   (message "Running use-jetbrains-mono-extrabold...")
;;   (face-remap-add-relative 'default '(:family "JetBrains Mono ExtraBold" :height 130)))

;; (with-eval-after-load 'dired
;;   (add-hook 'dired-mode-hook 'use-jetbrains-mono-extrabold))

#+end_src
** Minibuffer
*** Default
adding a function to minibuffer-setup-hook, which Emacs runs every time the minibuffer is entered
#+begin_src emacs-lisp
(defun set-minibuffer-font ()
  "Set the font for the minibuffer."
  (face-remap-add-relative 'default '(:family "JetBrains Mono NF ExtraBold" :height 100)))

(add-hook 'minibuffer-setup-hook 'set-minibuffer-font)
#+end_src
*** Prompt
#+begin_src emacs-lisp
(custom-set-faces
  '(minibuffer-prompt ((t (:family "JetBrains Mono NF ExtraBold" :height 120)))))
#+end_src
** Org
#+begin_src emacs-lisp
;; (defun my-set-org-mode-font ()
;;   "Set the font to JetBrains Mono NF ExtraBold when in org mode."
;;   (interactive)
;;   (when (derived-mode-p 'org-mode)
;;     (setq buffer-face-mode-face '(:family "JetBrains Mono NF ExtraBold" :height 1.1)) ;;  NF ExtraBold
;;     (buffer-face-mode)))

;; (add-hook 'org-mode-hook 'my-set-org-mode-font)
#+end_src
** Markdown
#+begin_src emacs-lisp
(defun my-set-markdown-mode-font ()
  "Set the font to JetBrains Mono NF ExtraBold when in markdown mode."
  (interactive)
  (when (derived-mode-p 'markdown-mode)
    (setq buffer-face-mode-face '(:family "JetBrains Mono NF ExtraBold" :height 1.1))
    (buffer-face-mode)))

(add-hook 'markdown-mode-hook 'my-set-markdown-mode-font)
#+end_src
** Python
set everything
#+begin_src emacs-lisp
(defun my-set-python-mode-font ()
  "Set the font to Space Mono when in python mode."
  (interactive)
  (when (derived-mode-p 'python-mode)
    (setq buffer-face-mode-face '(:family "jetbrains mono nl extrabold" :height 1.3)) ;; Ubuntu Mono
    (buffer-face-mode)))

(add-hook 'python-mode-hook 'my-set-python-mode-font)
#+end_src
* Dashboard
** scroll
fix the scroll
#+begin_src emacs-lisp

(defun my/dashboard-setup ()
  "Setup for dashboard."
  (my/dashboard-bindings)
  ;; Make the cursor invisible in dashboard
  (setq-local cursor-type nil)
  ;; Disable mouse scrolling
  (setq-local mouse-wheel-scroll-amount '(nil))
  (setq-local mouse-wheel-progressive-speed nil)
  ;; Turn off evil-mode in this buffer
  (evil-local-mode -1))

(add-hook 'dashboard-mode-hook 'my/dashboard-setup)



#+end_src
** Modeline
Modeline only for the dashboard
#+begin_src emacs-lisp

#+end_src
** Highlight
#+begin_src emacs-lisp
(defvar my/current-highlight-overlay nil
  "Overlay variable for current highlighted line.")

(defun my/dashboard-widget-forward (&optional arg)
  "Move point to the next field or button in the current buffer.
ARG is passed as an argument to 'widget-forward'.
Then apply highlighting to the current widget."
  (interactive "p")
  (widget-forward arg)
  (my/dashboard-highlight-widget))

(defun my/dashboard-widget-backward (&optional arg)
  "Move point to the previous field or button in the current buffer.
ARG is passed as an argument to 'widget-backward'.
Then apply highlighting to the current widget."
  (interactive "p")
  (widget-backward arg)
  (my/dashboard-highlight-widget))

(defun my/dashboard-highlight-widget ()
  "Highlight the current widget with overlay."
  (when-let ((widget (widget-at)))
    ;; Clear previous highlight
    (when my/current-highlight-overlay
      (delete-overlay my/current-highlight-overlay))
    ;; Create new highlight overlay only if the line is not empty
    (unless (looking-at-p "[[:space:]]*$")
      (let* ((start (progn (skip-chars-forward " \t") (point)))
             (end (point-at-eol))
             (overlay (make-overlay start end)))
        (overlay-put overlay 'face 'highlight)
        ;; Store new overlay
        (setq my/current-highlight-overlay overlay)))))

(defun my/dashboard-bindings ()
  "Add my keybindings for dashboard."
  (map! :map dashboard-mode-map
        :n "j" #'my/dashboard-widget-forward
        :n "k" #'my/dashboard-widget-backward
        :n "l" #'widget-button-press
        :n "h" #'ignore))

(defun my/dashboard-setup ()
  "Setup for dashboard."
  (my/dashboard-bindings)
  ;; Make the cursor invisible in dashboard
  (setq-local cursor-type nil))

(add-hook 'dashboard-mode-hook 'my/dashboard-setup)

#+end_src
** Conf
#+begin_src emacs-lisp
(require 'dashboard)
(setq dashboard-startup-banner 'logo)
(setq dashboard-center-content t)
(setq dashboard-show-shortcuts nil)

;; Set the title
(setq dashboard-banner-logo-title "Welcome to Emacs Dashboard")

;; Set the footer
(setq dashboard-footer-icon (all-the-icons-octicon "dash" :height 1.1 :v-adjust -0.05 :face 'font-lock-keyword-face))
(setq dashboard-footer-messages '("Dashboard is a minimal and nice looking startup screen."))

;; Set the content
(setq dashboard-items '((recents  . 5)
                        (projects . 5)))

;; Enable the dashboard at startup
(dashboard-setup-startup-hook)

;; Config for recent files
(require 'recentf)
(setq recentf-exclude '("/tmp/" "/ssh:"))
(setq recentf-max-saved-items 50)
(recentf-mode 1)

;; Config for projectile
(require 'projectile)
(setq projectile-completion-system 'ivy)
(projectile-mode 1)

;; Define the function to open the dashboard manually
(defun open-dashboard ()
  (interactive)
  (setq initial-buffer-choice (lambda () (get-buffer-create "*dashboard*"))))
(global-set-key (kbd "C-x d") 'dashboard-open)
#+end_src
** Keybinds
keybind within the dashboard
#+begin_src emacs-lisp
;; (defun my/dashboard-bindings ()
;;   "Add my keybindings for dashboard."
;;   (map! :map dashboard-mode-map
;;         :n "l" #'widget-button-press
;;         :n "h" #'ignore))
;;         :n "j" #'widget-forward
;;         :n "k" #'widget-backward

;; (add-hook 'dashboard-mode-hook 'my/dashboard-bindings)


;; (map! :map dashboard-mode-map
;;         "<mouse-4>" #'my/dashboard-widget-forward
;;         "<mouse-5>" #'my/dashboard-widget-backward
;;         :n "l" #'widget-button-press
;;         :n "h" #'ignore)

#+end_src
** Initial-buffer
Set dashboard as the initial buffer
#+begin_src emacs-lisp
(setq initial-buffer-choice (lambda () (get-buffer-create "*dashboard*")))
#+end_src
* Keybinds
