.config/doom/config.md


<a id="org996d172"></a>

# FONT

TODO

-   variables [] (OCR B)


<a id="orgae7d7d2"></a>

## Doom

Settings related to fonts within Doom Emacs:

-   &rsquo;doom-font&rsquo; &#x2013; standard monospace font that is used for most things in Emacs.
-   &rsquo;doom-variable-pitch-font&rsquo; &#x2013; variable font which is useful in some Emacs plugins.
-   &rsquo;doom-big-font&rsquo; &#x2013; used in doom-big-font-mode; useful for presentations.
-   &rsquo;font-lock-comment-face&rsquo; &#x2013; for comments.
-   &rsquo;font-lock-keyword-face&rsquo; &#x2013; for keywords with special significance like &rsquo;setq&rsquo; in elisp.

    (setq doom-font (font-spec :family "JetBrains Mono NF ExtraBold" :size 15) ;; :height 1.1)
          doom-variable-pitch-font (font-spec :family "Ubuntu" :size 15)
          doom-big-font (font-spec :family "JetBrains Mono" :size 24))
    (after! doom-themes
      (setq doom-themes-enable-bold t
            doom-themes-enable-italic t))
    (custom-set-faces!
      '(font-lock-comment-face :slant italic)
      '(font-lock-keyword-face :slant italic))


<a id="org114bbe1"></a>

## Dired

    ;; (defun use-ocr-b-bold ()
    ;;   "Switch the current buffer to the OCR B-Bold font."
    ;;   (face-remap-add-relative 'default '(:family "JetBrains Mono NF ExtraBold" :height 130)))
    
    ;; (add-hook 'dired-mode-hook 'use-ocr-b-bold)
    
    
    ;; (defun use-jetbrains-mono-extrabold ()
    ;;   "Switch the current buffer to JetBrains Mono ExtraBold font."
    ;;   (interactive)
    ;;   (message "Running use-jetbrains-mono-extrabold...")
    ;;   (face-remap-add-relative 'default '(:family "JetBrains Mono ExtraBold" :height 130)))
    
    ;; (with-eval-after-load 'dired
    ;;   (add-hook 'dired-mode-hook 'use-jetbrains-mono-extrabold))


<a id="orgf6f8e84"></a>

## Minibuffer


<a id="orgf205604"></a>

### Default

adding a function to minibuffer-setup-hook, which Emacs runs every time the minibuffer is entered

    (defun set-minibuffer-font ()
      "Set the font for the minibuffer."
      (face-remap-add-relative 'default '(:family "JetBrains Mono NF ExtraBold" :height 100)))
    
    (add-hook 'minibuffer-setup-hook 'set-minibuffer-font)


<a id="org1788dd3"></a>

### Prompt

    (custom-set-faces
      '(minibuffer-prompt ((t (:family "JetBrains Mono NF ExtraBold" :height 120)))))


<a id="org5557fd2"></a>

## Org

    ;; (defun my-set-org-mode-font ()
    ;;   "Set the font to JetBrains Mono NF ExtraBold when in org mode."
    ;;   (interactive)
    ;;   (when (derived-mode-p 'org-mode)
    ;;     (setq buffer-face-mode-face '(:family "JetBrains Mono NF ExtraBold" :height 1.1)) ;;  NF ExtraBold
    ;;     (buffer-face-mode)))
    
    ;; (add-hook 'org-mode-hook 'my-set-org-mode-font)


<a id="orgcfbfeac"></a>

## Markdown

    (defun my-set-markdown-mode-font ()
      "Set the font to JetBrains Mono NF ExtraBold when in markdown mode."
      (interactive)
      (when (derived-mode-p 'markdown-mode)
        (setq buffer-face-mode-face '(:family "JetBrains Mono NF ExtraBold" :height 1.1))
        (buffer-face-mode)))
    
    (add-hook 'markdown-mode-hook 'my-set-markdown-mode-font)


<a id="orgdfb6891"></a>

## Python

set everything

    (defun my-set-python-mode-font ()
      "Set the font to Space Mono when in python mode."
      (interactive)
      (when (derived-mode-p 'python-mode)
        (setq buffer-face-mode-face '(:family "jetbrains mono nl extrabold" :height 1.3)) ;; Ubuntu Mono
        (buffer-face-mode)))
    
    (add-hook 'python-mode-hook 'my-set-python-mode-font)


<a id="org5afddf1"></a>

# Dashboard


<a id="orgb49057b"></a>

## scroll

fix the scroll

    
    (defun my/dashboard-setup ()
      "Setup for dashboard."
      (my/dashboard-bindings)
      ;; Make the cursor invisible in dashboard
      (setq-local cursor-type nil)
      ;; Disable mouse scrolling
      (setq-local mouse-wheel-scroll-amount '(nil))
      (setq-local mouse-wheel-progressive-speed nil)
      ;; Turn off evil-mode in this buffer
      (evil-local-mode -1))
    
    (add-hook 'dashboard-mode-hook 'my/dashboard-setup)


<a id="orgab7d298"></a>

## Modeline

Modeline only for the dashboard


<a id="org1afe1f5"></a>

## Highlight

    (defvar my/current-highlight-overlay nil
      "Overlay variable for current highlighted line.")
    
    (defun my/dashboard-widget-forward (&optional arg)
      "Move point to the next field or button in the current buffer.
    ARG is passed as an argument to 'widget-forward'.
    Then apply highlighting to the current widget."
      (interactive "p")
      (widget-forward arg)
      (my/dashboard-highlight-widget))
    
    (defun my/dashboard-widget-backward (&optional arg)
      "Move point to the previous field or button in the current buffer.
    ARG is passed as an argument to 'widget-backward'.
    Then apply highlighting to the current widget."
      (interactive "p")
      (widget-backward arg)
      (my/dashboard-highlight-widget))
    
    (defun my/dashboard-highlight-widget ()
      "Highlight the current widget with overlay."
      (when-let ((widget (widget-at)))
        ;; Clear previous highlight
        (when my/current-highlight-overlay
          (delete-overlay my/current-highlight-overlay))
        ;; Create new highlight overlay only if the line is not empty
        (unless (looking-at-p "[[:space:]]*$")
          (let* ((start (progn (skip-chars-forward " \t") (point)))
                 (end (point-at-eol))
                 (overlay (make-overlay start end)))
            (overlay-put overlay 'face 'highlight)
            ;; Store new overlay
            (setq my/current-highlight-overlay overlay)))))
    
    (defun my/dashboard-bindings ()
      "Add my keybindings for dashboard."
      (map! :map dashboard-mode-map
            :n "j" #'my/dashboard-widget-forward
            :n "k" #'my/dashboard-widget-backward
            :n "l" #'widget-button-press
            :n "h" #'ignore))
    
    (defun my/dashboard-setup ()
      "Setup for dashboard."
      (my/dashboard-bindings)
      ;; Make the cursor invisible in dashboard
      (setq-local cursor-type nil))
    
    (add-hook 'dashboard-mode-hook 'my/dashboard-setup)


<a id="org7418a61"></a>

## Conf

    (require 'dashboard)
    (setq dashboard-startup-banner 'logo)
    (setq dashboard-center-content t)
    (setq dashboard-show-shortcuts nil)
    
    ;; Set the title
    (setq dashboard-banner-logo-title "Welcome to Emacs Dashboard")
    
    ;; Set the footer
    (setq dashboard-footer-icon (all-the-icons-octicon "dash" :height 1.1 :v-adjust -0.05 :face 'font-lock-keyword-face))
    (setq dashboard-footer-messages '("Dashboard is a minimal and nice looking startup screen."))
    
    ;; Set the content
    (setq dashboard-items '((recents  . 5)
                            (projects . 5)))
    
    ;; Enable the dashboard at startup
    (dashboard-setup-startup-hook)
    
    ;; Config for recent files
    (require 'recentf)
    (setq recentf-exclude '("/tmp/" "/ssh:"))
    (setq recentf-max-saved-items 50)
    (recentf-mode 1)
    
    ;; Config for projectile
    (require 'projectile)
    (setq projectile-completion-system 'ivy)
    (projectile-mode 1)
    
    ;; Define the function to open the dashboard manually
    (defun open-dashboard ()
      (interactive)
      (setq initial-buffer-choice (lambda () (get-buffer-create "*dashboard*"))))
    (global-set-key (kbd "C-x d") 'dashboard-open)


<a id="org5d68e64"></a>

## Keybinds

keybind within the dashboard

    ;; (defun my/dashboard-bindings ()
    ;;   "Add my keybindings for dashboard."
    ;;   (map! :map dashboard-mode-map
    ;;         :n "l" #'widget-button-press
    ;;         :n "h" #'ignore))
    ;;         :n "j" #'widget-forward
    ;;         :n "k" #'widget-backward
    
    ;; (add-hook 'dashboard-mode-hook 'my/dashboard-bindings)
    
    
    ;; (map! :map dashboard-mode-map
    ;;         "<mouse-4>" #'my/dashboard-widget-forward
    ;;         "<mouse-5>" #'my/dashboard-widget-backward
    ;;         :n "l" #'widget-button-press
    ;;         :n "h" #'ignore)


<a id="orgfc19d64"></a>

## Initial-buffer

Set dashboard as the initial buffer

    (setq initial-buffer-choice (lambda () (get-buffer-create "*dashboard*")))
