.config/doom/config.org
** Diff
#+begin_src emacs-lisp
(map! :leader
      (:prefix ("d" . "diff")
        :desc "diff buffer with file" "i" #'laluxx/diff-buffer-with-file))

#+end_src
** Regex
#+begin_src emacs-lisp
(map! :leader
      (:prefix ("r" . "regexp")
        :desc "Regex builder" "b" #'re-builder))
#+end_src
** Org
#+begin_src emacs-lisp
(after! org
  (map! :map org-mode-map
        :nvi "<C-return>" #'laluxx/create-window-based-on-layout
        :nvi "<C-M-return>" #'vterm
        :nvi "C-j" #'my-switch-buffer-forward-or-other-window
        :nvi "C-k" #'my-switch-buffer-backward-or-other-window))

#+end_src
** Toggle
#+begin_src emacs-lisp
(map! :leader
      (:prefix ("t" . "Toggle")
       :desc "Toggle truncated lines" "t" #'visual-line-mode))
#+end_src
** Btop
open a new window containing btop
#+begin_src emacs-lisp


#+end_src
** Org
*** block-jump
if inside a src code block
shift + j -> cursor at the end of the code block
shift + k -> cursor at the start of the code block
#+begin_src emacs-lisp
(defun my/org-beginning-of-src-block ()
  "Move point to the beginning of the current source block."
  (interactive)
  (when (org-in-src-block-p)
    (search-backward "#+begin_src")
    (forward-line)
    (beginning-of-line)))

(defun my/org-end-of-src-block ()
  "Move point to the end of the current source block."
  (interactive)
  (when (org-in-src-block-p)
    (search-forward "#+end_src")
    (backward-char 11)))

(defun my/org-src-keybindings ()
  "Setup keybindings for org-src-mode."
  (when (org-in-src-block-p)
    (let ((map (make-sparse-keymap)))
      (define-key map (kbd "M-k") 'my/org-beginning-of-src-block)
      (define-key map (kbd "M-j") 'my/org-end-of-src-block)
      (set-transient-map map t))))

(add-hook 'org-mode-hook 'my/org-src-keybindings)

(with-eval-after-load 'evil-maps
  (define-key evil-visual-state-map (kbd "M-k") 'my/org-beginning-of-src-block)
  (define-key evil-visual-state-map (kbd "M-j") 'my/org-end-of-src-block))

#+end_src
*** Shifttab
#+begin_src emacs-lisp
;; MAIN
(defun my/org-shifttab-advice (orig-fun &rest args)
  "Always use global cycling with `org-shifttab'."
  (let ((context (org-element-lineage
                  (org-element-context)
                  '(headline inlinetask) t)))
    (if (or (not context)
            (eq 'headline (org-element-type context)))
        (apply 'org-global-cycle args)
      (apply orig-fun args))))

(advice-add 'org-shifttab :around 'my/org-shifttab-advice)


(defun my/org-shifttab-or-beginning-of-line ()
  "Call org-shifttab, then move to the beginning of the line."
  (interactive)
  (org-shifttab)
  (run-at-time "0.3 sec" nil #'beginning-of-line))

(with-eval-after-load 'org
  (define-key org-mode-map (kbd "<backtab>") #'my/org-shifttab-or-beginning-of-line))


#+end_src
*** Evil
open org bullets with =l= and close them with =h=
#+begin_src emacs-lisp
(defun my-org-cycle-or-move-right ()
  (interactive)
  (if (and (bolp) (org-at-heading-p))
      (org-cycle)
    (evil-forward-char 1)))

(defun my-org-close-or-move-left ()
  (interactive)
  (if (and (bolp) (org-at-heading-p))
      (outline-hide-subtree)
    (evil-backward-char 1)))

(add-hook 'org-mode-hook
          (lambda ()
            (evil-define-key 'normal org-mode-map
              (kbd "l") 'my-org-cycle-or-move-right)
            (evil-define-key 'normal org-mode-map
              (kbd "h") 'my-org-close-or-move-left)))
#+end_src
*** Mouse
#+begin_src emacs-lisp
;; OVERLAY DONE
(defvar org-headline-overlay nil)
(defvar org-last-highlighted-line nil)

(defun org-highlight-headline ()
  (when (org-at-heading-p)
    (if org-headline-overlay
        (move-overlay org-headline-overlay (line-beginning-position) (line-end-position))
      (setq org-headline-overlay (make-overlay (line-beginning-position) (line-end-position))))
    (overlay-put org-headline-overlay 'face 'highlight)
    (setq org-last-highlighted-line (line-number-at-pos))))

(defun org-unhighlight-headline ()
  (when org-headline-overlay
    (delete-overlay org-headline-overlay)))

(defun org-next-headline-or-wrap ()
  (interactive)
  (org-unhighlight-headline)
  (let ((initial-position (point)))
    (org-next-visible-heading 1)
    (when (= (point) initial-position)
      (goto-char (point-min))))
  (org-highlight-headline))

(defun org-previous-headline-or-wrap ()
  (interactive)
  (org-unhighlight-headline)
  (let ((initial-position (point)))
    (unless (and (eobp) (looking-at-p "^$"))
      (org-previous-visible-heading 1))
    (when (= (point) initial-position)
      (goto-char (point-max))
      (org-previous-visible-heading 1)))
  (org-highlight-headline))

(defun org-go-to-last-highlighted-line ()
  (interactive)
  (when org-last-highlighted-line
    (goto-line org-last-highlighted-line)
    (org-highlight-headline)))

(add-hook 'org-mode-hook
          (lambda ()
            (define-key org-mode-map (kbd "<S-mouse-4>") 'org-previous-headline-or-wrap)
            (define-key org-mode-map (kbd "<S-mouse-5>") 'org-next-headline-or-wrap)
            (define-key org-mode-map (kbd "<S-mouse-2>") 'org-go-to-last-highlighted-line)
            (define-key org-mode-map (kbd "<S-mouse-8>") 'org-cycle)
            (define-key org-mode-map (kbd "<M-mouse-4>") 'previous-line)
            (define-key org-mode-map (kbd "<M-mouse-5>") 'next-line)
            (define-key org-mode-map (kbd "M-C-j") 'org-next-headline-or-wrap)
            (define-key org-mode-map (kbd "M-C-k") 'org-previous-headline-or-wrap)
            (define-key org-mode-map (kbd "<S-mouse-9>") (lambda () (interactive) (org-cycle t)))))
#+end_src
*** Insert-header-tags
#+begin_src emacs-lisp
(map! :leader
      :desc "Insert header tags"
      "i o" #'org-insert-header-tags)
#+end_src
*** Jump
#+begin_src emacs-lisp
(map! :leader
      :desc "Jump to tangled file"
      "o j" #'org-jump-to-tangled)
#+end_src
*** Split-jump
Jump, vsplit and set zoom if tangled file exist
#+begin_src emacs-lisp
(map! :leader
      :desc "Split and jump to tangled file with zoom"
      "o J" #'org-jump-to-tangled-split-and-zoom)
#+end_src
** Shells
#+begin_src emacs-lisp
(map! :leader
      :desc "Eshell"                 "e s" #'eshell
      :desc "Eshell popup toggle"    "t e" #'+eshell/toggle
      :desc "Counsel eshell history" "e h" #'counsel-esh-history
      :desc "Vterm popup toggle"     "v t" #'+vterm/toggle)
#+end_src
** Doom overwrite
#+begin_src emacs-lisp
(map! :leader
      :desc "Kill buffer and open dashboard if last buffer"
      "b k" 'kill-buffer-and-maybe-open-dashboard)
#+end_src
** General-key
Keybinds that execute other keybinds.
*** Dir-split-jump
#+begin_src emacs-lisp
(map! :leader
      :desc "Custom Keybind"
      "d J" (lambda ()
              (interactive)

              (text-scale-set -1)  ;; Set the desired zoom level here
              (execute-kbd-macro (kbd "SPC w v"))
              (execute-kbd-macro (kbd "SPC d j"))))
#+end_src
** Dmenu
#+begin_src emacs-lisp
(global-set-key (kbd "M-p") 'dmenu)
#+end_src
** HELP
*** Hooks
#+begin_src emacs-lisp
(map! :leader
      :desc "Show all hooks"
      "hh" #'laluxx/list-hooks)
#+end_src

* FUNCTIONS
** XOS
** update-dotfiles
whenever you save a file inside "~/Desktop/pulls/dotfiles"
or one of its subdirectories && if that file is a org file
#+begin_src emacs-lisp
(defun laluxx/update-dotfiles ()
  "Update dotfiles."
  (interactive)
  (let* ((dotfiles-path (expand-file-name "~/Desktop/pulls/dotfiles"))
         (command (concat "rsync -a " dotfiles-path "/. $HOME/")))
    (shell-command command)
    (message "Updated dotfiles")))

#+end_src
