.config/doom/config.md


<a id="org01daa87"></a>

### run-update-dotfiles

    ;; ONLY org
    ;; (defun laluxx/run-update-dotfiles ()
    ;;   "Run `laluxx/update-dotfiles` if the current file is inside ~/Desktop/pulls/dotfiles or its subdirectories."
    ;;   (when (and buffer-file-name
    ;;              (string-prefix-p (expand-file-name "~/Desktop/pulls/dotfiles") buffer-file-name)
    ;;              (string= (file-name-extension buffer-file-name) "org"))
    ;;     (laluxx/update-dotfiles)))
    
    ;; (add-hook 'after-save-hook 'laluxx/run-update-dotfiles)
    
    ;; ALL file extentions
    (defun laluxx/run-update-dotfiles ()
      "Run `laluxx/update-dotfiles` if the current file is inside ~/Desktop/pulls/dotfiles or its subdirectories."
      (when (and buffer-file-name
                 (string-prefix-p (expand-file-name "~/Desktop/pulls/dotfiles") buffer-file-name))
        (laluxx/update-dotfiles)))
    
    (add-hook 'after-save-hook 'laluxx/run-update-dotfiles)


<a id="org455b8c7"></a>

## Diff

    ;;   (defun laluxx/diff-buffer-with-file (&optional arg)
    ;;     "Compare buffer to its file, else run `vc-diff'.
    ;; With \\[universal-argument] also enable highlighting of word-wise
    ;; changes, local to the current buffer."
    ;;     (interactive "P")
    ;;     (let ((buf nil))     ; this method will "fail" if multi diff buffers
    ;;       (if (buffer-modified-p)
    ;;           (progn
    ;;             (diff-buffer-with-file (current-buffer))
    ;;             (setq buf "*Diff*"))
    ;;         (vc-diff)
    ;;         (setq buf "*vc-diff*"))
    ;;       (when arg
    ;;         (with-current-buffer (get-buffer buf)
    ;;           (setq-local diff-refine 'font-lock)))))
    
    
    (defvar laluxx/diff-buffer nil
      "Stores the current diff buffer if one exists.")
    
    (defun laluxx/diff-buffer-with-file (&optional arg)
      "Compare buffer to its file, else run `vc-diff'.
    With \\[universal-argument] also enable highlighting of word-wise
    changes, local to the current buffer."
      (interactive "P")
      (if (and laluxx/diff-buffer
               (buffer-live-p laluxx/diff-buffer)
               (get-buffer-window laluxx/diff-buffer t))
          (progn
            (kill-buffer laluxx/diff-buffer)
            (setq laluxx/diff-buffer nil))
        (if (and (not laluxx/diff-buffer)
                 (or (not (buffer-live-p laluxx/diff-buffer))
                     (not (get-buffer-window laluxx/diff-buffer t))))
            (let ((buf nil))
              (if (buffer-modified-p)
                  (progn
                    (diff-buffer-with-file (current-buffer))
                    (setq buf "*Diff*"))
                (vc-diff)
                (setq buf "*vc-diff*"))
              (setq laluxx/diff-buffer (get-buffer buf))
              (display-buffer laluxx/diff-buffer)
              (when arg
                (with-current-buffer laluxx/diff-buffer
                  (setq-local diff-refine 'font-lock)))))))


<a id="org9a526f6"></a>

## emacs-Window-manager


<a id="org96a9524"></a>

### Edwina

    (use-package! edwina
      :config
      ;; Your config here...
      (setq display-buffer-base-action '(display-buffer-below-selected))
      (edwina-setup-dwm-keys)
      (edwina-mode 1))


<a id="org8916bad"></a>

### Enlarge OR neotree OR re-builder

1.  Default

    If there is only one window, \`ctrl h\` and \`ctrl l\` will cycle buffers. If there are multiple windows, \`ctrl h\` and \`ctrl l\` will resize the windows.
    
        (defun enlarge-window-horizontally-left ()
          "Enlarges the window horizontally by 10 units."
          (interactive)
          (enlarge-window-horizontally 10))
        
        (defun shrink-window-horizontally-left ()
          "Shrinks the window horizontally by 10 units."
          (interactive)
          (shrink-window-horizontally 10))
        
        (defun enlarge-window-horizontally-right ()
          "Enlarges the window horizontally by 10 units."
          (interactive)
          (shrink-window-horizontally 10))
        
        (defun shrink-window-horizontally-right ()
          "Shrinks the window horizontally by 10 units."
          (interactive)
          (enlarge-window-horizontally 10))
        
        (defun resize-window-horizontally (increase)
          "Resize the current window horizontally.
        If INCREASE is non-nil, enlarge the window, otherwise shrink it."
          (interactive "P")
          (if (window-in-direction 'right)
              (if increase
                  (shrink-window-horizontally-right)
                (enlarge-window-horizontally-right))
            (if increase
                (enlarge-window-horizontally-left)
              (shrink-window-horizontally-left))))
        
        (defun neotree-or-enlarge-window-left ()
          "Open Neotree if there's only one window. Otherwise, enlarge the window to the left."
          (interactive)
          (if (one-window-p)
              (neotree-show)
            (resize-window-horizontally t)))
        
        (defun re-builder-or-enlarge-window-right ()
          "Open Re-Builder if there's only one window. Otherwise, enlarge the window to the right."
          (interactive)
          (if (one-window-p)
              (re-builder)
            (resize-window-horizontally nil)))
        
        (global-set-key (kbd "C-h") 'neotree-or-enlarge-window-left)
        (global-set-key (kbd "C-l") 're-builder-or-enlarge-window-right)


<a id="org97aad3d"></a>

### Highlight

    ;; (defun highlight-selected-window ()
    ;;   "Highlight selected window with a different background color."
    ;;   (walk-windows (lambda (w)
    ;;                   (unless (or (eq w (selected-window)) (minibufferp (window-buffer w)))
    ;;                     (with-current-buffer (window-buffer w)
    ;;                       (buffer-face-set '(:background "#f6f6f6"))))))
    ;;   (unless (minibufferp (window-buffer (selected-window)))
    ;;     (buffer-face-set 'default)))
    
    ;; (add-hook 'buffer-list-update-hook 'highlight-selected-window)
    
    ;; Main
    ;; (require 'color)
    
    ;; (defun highlight-selected-window ()
    ;;   "Highlight selected window with a different background color."
    ;;   (let ((bg (face-attribute 'default :background)))
    ;;     (walk-windows (lambda (w)
    ;;                     (unless (or (eq w (selected-window)) (minibufferp (window-buffer w)))
    ;;                       (with-current-buffer (window-buffer w)
    ;;                         (buffer-face-set `(:background ,(color-darken-name bg 35))))))))
    ;;   (unless (minibufferp (window-buffer (selected-window)))
    ;;     (buffer-face-set 'default)))
    
    ;; (add-hook 'buffer-list-update-hook 'highlight-selected-window)
    
    
    
    ;; FRINGE FIX
    (defun highlight-selected-window ()
      "Highlight selected window with a different background color."
      (let ((bg (face-attribute 'default :background)))
        (walk-windows (lambda (w)
                        (if (eq w (selected-window))
                            (progn
                              (with-current-buffer (window-buffer w)
                                (buffer-face-set 'default))
                              (with-selected-window w
                                (set-face-attribute 'fringe nil :background bg)))
                          (with-current-buffer (window-buffer w)
                            (buffer-face-set `(:background ,(color-darken-name bg 35))))
                          (with-selected-window w
                            (set-face-attribute 'fringe nil :background (color-darken-name bg 35))))))))
    (add-hook 'buffer-list-update-hook 'highlight-selected-window)
