.config/doom/config.md


<a id="orgd1bd582"></a>

## Wal-Set


<a id="org251a7b1"></a>

### Default

    (defun laluxx/wal-set ()
      (interactive)
      (let* ((default-directory "~/xos/wallpapers/static")
             (theme-directory "~/xos/theme")
             (pywal-scripts-directory "~/xos/pywal-scripts")
             (image-files (directory-files-recursively default-directory "\\.\\(png\\|jpg\\|jpeg\\|webp\\)$")))
        (ivy-read "Choose wallpaper: "
                  image-files
                  :action (lambda (wallpaper)
                            (when (and (not (string-empty-p wallpaper))
                                       (file-exists-p wallpaper))
                              (let ((abs-wallpaper (expand-file-name wallpaper)))
                                (shell-command-to-string (concat "wal -i " abs-wallpaper))
                                (with-temp-file (concat theme-directory "/.wallpaper")
                                  (insert abs-wallpaper))
                                (shell-command-to-string "theme pywal --no-random")
                                (dolist (script '("xmonad-dark-wal.py" "nvim-wal.py" "nvim-wal-dark.py"))
                                  (shell-command-to-string (concat "python3 " pywal-scripts-directory "/" script)))
                                (shell-command-to-string "xmonad --restart")
                                ;; (shell-command "papirus-wal")
                                ;; (shell-command-to-string "oomox-gtk-gen")
                                ;; (laluxx/load-org-wal-colors)
                                (run-at-time "1 sec" nil 'spaceline-compile)))))))  ; Delay spaceline-compile


<a id="org39d131d"></a>

### Favourite

Set a wal paper from `~/xos/wallpapers/favourites`

    (defun laluxx/wal-set-favourite ()
      (interactive)
      (let* ((default-directory "~/xos/wallpapers/favourites")
             (theme-directory "~/xos/theme")
             (pywal-scripts-directory "~/xos/pywal-scripts")
             (image-files (directory-files-recursively default-directory "\\.\\(png\\|jpg\\|jpeg\\|webp\\)$")))
        (ivy-read "Favourite wallpapers: "
                  image-files
                  :action (lambda (wallpaper)
                            (when (and (not (string-empty-p wallpaper))
                                       (file-exists-p wallpaper))
                              (let ((abs-wallpaper (expand-file-name wallpaper)))
                                (shell-command-to-string (concat "wal -i " abs-wallpaper))
                                (with-temp-file (concat theme-directory "/.wallpaper")
                                  (insert abs-wallpaper))
                                (shell-command-to-string "theme pywal --no-random")
                                (dolist (script '("xmonad-dark-wal.py" "nvim-wal.py" "nvim-wal-dark.py"))
                                  (shell-command-to-string (concat "python3 " pywal-scripts-directory "/" script)))
                                (shell-command-to-string "xmonad --restart")
                                ;; (shell-command "papirus-wal")
                                ;; (shell-command-to-string "oomox-gtk-gen")
                                ;; (laluxx/load-org-wal-colors)
                                (run-at-time "1 sec" nil 'spaceline-compile)))))))  ; Delay spaceline-compile


<a id="org60d7167"></a>

### solid

Choose a wal paper from `~/xos/wallpapers`
and turn it solid

    (defun laluxx/wal-set-solid ()
      (interactive)
      (let* ((default-directory "~/xos/wallpapers/static")
             (theme-directory "~/xos/theme")
             (pywal-scripts-directory "~/xos/pywal-scripts")
             (solid-wallpapers-directory "~/xos/wallpapers/solid")
             (image-files (directory-files-recursively default-directory "\\.\\(png\\|jpg\\|jpeg\\|webp\\)$")))
        (ivy-read "Wallpapers to turn solid: "
                  image-files
                  :action (lambda (wallpaper)
                            (when (and (not (string-empty-p wallpaper))
                                       (file-exists-p wallpaper))
                              (let* ((abs-wallpaper (expand-file-name wallpaper))
                                     (base-wallpaper-name (file-name-base wallpaper))  ;; Get the filename without extension
                                     (solid-wallpaper (concat solid-wallpapers-directory "/" base-wallpaper-name "-SOLID.png")))
                                (if (file-exists-p solid-wallpaper)
                                    (shell-command-to-string (concat "wal -i " solid-wallpaper))
                                  (progn
                                    (shell-command-to-string (concat "wal -n -i " abs-wallpaper)) ;; Use wal -n to generate colors without setting wallpaper
                                    (shell-command-to-string (concat "wal-set-solid " base-wallpaper-name))))
                                (with-temp-file (concat theme-directory "/.wallpaper")
                                  (insert abs-wallpaper))
                                (shell-command-to-string "theme pywal --no-random")
                                (dolist (script '("xmonad-dark-wal.py" "nvim-wal.py" "nvim-wal-dark.py"))
                                  (shell-command-to-string (concat "python3 " pywal-scripts-directory "/" script)))
                                (shell-command-to-string "xmonad --restart")
                                (run-at-time "1 sec" nil 'spaceline-compile)))))))  ; Delay spaceline-compile


<a id="orgf42e10b"></a>

### Set-wallpaper

set system wallpaper

    (defun laluxx/set-wallpaper ()
      (interactive)
      (let* ((default-directory "~/xos/wallpapers/static")
             (image-files (directory-files-recursively default-directory "\\.\\(png\\|jpg\\|jpeg\\|webp\\)$")))
        (ivy-read "Choose wallpaper: "
                  image-files
                  :action (lambda (wallpaper)
                            (when (and (not (string-empty-p wallpaper))
                                       (file-exists-p wallpaper))
                              (let ((abs-wallpaper (expand-file-name wallpaper)))
                                (shell-command-to-string (concat "feh --bg-scale " abs-wallpaper))))))))


<a id="org205d3ec"></a>

## Doom-wal

doom the wallpaper

    ;; TODO: set a specific wallpaper based on the theme,                                            [x]  set-wallpaper-to-match-doom-theme
    ;; TODO: org bullets should use those colors too,                                                []
    ;; TODO: make a version of this function that let you consuel a theme and do everything,         []
    ;; TODO: make this function send a signal to xmonad to set all workspaces to "threecol"          []
    
    (defun laluxx/doom-wal ()
      "Run theme-magic-from-emacs, PyWal scripts and execute PyWal scripts."
      (interactive)
      (theme-magic-from-emacs)
      (shell-command "pkill picom")
      (shell-command "python3 /home/l/xos/pywal-scripts/xmonad-dark-wal.py")    ;; Xmonad dark  theme
      ;; (shell-command "python3 /home/l/xos/pywal-scripts/xmonad-light-wal.py") ;; light theme
      (laluxx/set-wallpaper-to-match-doom-theme)
      (shell-command "xmonad --restart"))
      (shell-command "python3 /home/l/xos/pywal-scripts/nvim-wal.py")
