.config/doom/config.md


<a id="org359d5a3"></a>

## Doom-wal-light

    ;; TODO: set a specific wallpaper based on the theme,                                            [x]  set-wallpaper-to-match-doom-theme
    ;; TODO: org bullets should use those colors too,                                                []
    ;; TODO: make a version of this function that let you consuel a theme and do everything,         []
    ;; TODO: make this function send a signal to xmonad to set all workspaces to "threecol"          []
    
    (defun laluxx/doom-wal-light ()
      "Run theme-magic-from-emacs, PyWal scripts and execute PyWal scripts."
      (interactive)
      (theme-magic-from-emacs)
      (shell-command "pkill picom")
      (shell-command "python3 /home/l/xos/pywal-scripts/xmonad-light-wal.py") ;; xmonad light theme
      (laluxx/set-wallpaper-to-match-doom-theme)
      (shell-command "xmonad --restart"))
      (shell-command "python3 /home/l/xos/pywal-scripts/nvim-wal.py")


<a id="org3dcc5f5"></a>

## set-wallpaper-to-match-doom-theme

will look into `~/xos/wallpaper/doom` for wallpapers called like doom-one.png or ef-summer.jpg

    (defun laluxx/set-wallpaper-to-match-doom-theme ()
      "Set the desktop wallpaper based on the current Doom Emacs theme."
    
      (interactive)
    
      (let* ((theme-name (symbol-name doom-theme))
             (wallpaper-base-path "~/xos/wallpapers/doom/")
             (png-wallpaper (concat wallpaper-base-path theme-name ".png"))
             (jpg-wallpaper (concat wallpaper-base-path theme-name ".jpg"))
             (wallpaper nil))
    
        ;; Check for PNG and then JPG wallpaper
        (if (file-exists-p png-wallpaper)
            (setq wallpaper png-wallpaper)
          (if (file-exists-p jpg-wallpaper)
              (setq wallpaper jpg-wallpaper)))
    
        ;; If a matching wallpaper was found, set it using feh
        (if wallpaper
            (shell-command (concat "feh --bg-scale " wallpaper))
          (message "No matching wallpaper found for theme '%s'" theme-name))))


<a id="org3d91085"></a>

## Org

    (defun org-insert-header-tags ()
      "Insert personalized header tags at the beginning of the current Org file."
      (interactive)
      (goto-char (point-min)) ; Move to the beginning of the buffer
      (insert "#+TITLE: \n") ; Insert TITLE tag
      (insert "#+AUTHOR: laluxx\n") ; Insert AUTHOR tag with your desired value
      (insert "#+DESCRIPTION: \n") ; Insert DESCRIPTION tag
      (insert "#+STARTUP: showeverything\n") ; Insert STARTUP tag
      (insert "#+PROPERTY: header-args :tangle\n") ; Insert TANGLE tag
      (insert "\n") ; Insert a newline for separation
      (message "Header tags inserted.")
      (evil-goto-first-line) ; Move cursor to the top of the buffer
      (evil-append-line 0)) ; Move cursor to the end of the line (after TITLE) and enter insert mode (Evil)

    (defun org-jump-to-tangled ()
      "Jump to the tangled file corresponding to the current Org mode file."
      (interactive)
      (let ((tangled-file (org-jump-to-tangled-file-name)))
        (if tangled-file
            (find-file (expand-file-name tangled-file (file-name-directory buffer-file-name)))
          (message "Tangled file not specified in the document."))))
    
    (defun org-jump-to-tangled-file-name ()
      "Extract the tangled file name from the Org mode file properties.
    If not specified, return nil."
      (save-excursion
        (goto-char (point-min))
        (when (re-search-forward "^#\\+PROPERTY: header-args :tangle \\(.+\\)$" nil t)
          (match-string 1))))
    
    (defun org-jump-to-tangled-split-and-zoom ()
      "Split the window vertically, jump to the tangled file corresponding to the current Org mode file in the new window, and adjust the zoom level."
      (interactive)
      (let ((tangled-file (org-jump-to-tangled-file-name)))
        (if tangled-file
            (progn
              (text-scale-set -1)  ;; Set the desired zoom level here
              (execute-kbd-macro (kbd "SPC w v"))  ;; Split window vertically
              (execute-kbd-macro (kbd "SPC o j"))) ;; Jump to tangled
          (message "Tangled file not specified in the document."))))


<a id="org785a65a"></a>

## List-hooks

    (defun laluxx/list-hooks ()
      "List all hooks in a completing-read interface."
      (interactive)
      (let* ((hook-symbols (sort
                            (seq-filter (lambda (sym)
                                          (and (symbolp sym)
                                               (string-suffix-p "-hook" (symbol-name sym))))
                                        (append obarray nil))
                            #'string-lessp))
             (hooks (mapcar #'symbol-name hook-symbols))
             (selected-hook (completing-read "Hooks: " hooks)))
        (when selected-hook
          (describe-variable (intern selected-hook)))))


<a id="org0dfb6cb"></a>

### Open-dir

    (defun open-dir (key desc dir)
      (map! :leader
            :desc desc
            key (lambda () (interactive) (dired dir))))


<a id="org6ca43bb"></a>

# Open-dir-keybind

open-dir defined in `FUNCTIONS`

    (open-dir "f P" "Open dotfiles directory" "~/Desktop/pulls/dotfiles/.config/doom")
    (open-dir "f t" "Open test directory" "~/Desktop/test")
    (open-dir "f x" "Open xos directory" "~/xos")
    (open-dir "f z" "Open dotfiles zsh directory" "~/Desktop/pulls/dotfiles/.config/zsh")
    (open-dir "f c" "Open ~/.config" "~/.config")


<a id="org68bf34a"></a>

# IVY


<a id="orgf911fd5"></a>

## IVY-POSFRAME

Available functions (positions) for &rsquo;ivy-posframe-display-functions-alist&rsquo;

-   ivy-posframe-display-at-frame-center
-   ivy-posframe-display-at-window-center
-   ivy-posframe-display-at-frame-bottom-left
-   ivy-posframe-display-at-window-bottom-left
-   ivy-posframe-display-at-frame-bottom-window-center
-   ivy-posframe-display-at-point
-   ivy-posframe-display-at-frame-top-center

`NOTE:` If the setting for &rsquo;ivy-posframe-display&rsquo; is set to &rsquo;nil&rsquo; (false), anything that is set to &rsquo;ivy-display-function-fallback&rsquo; will just default to their normal position in Doom Emacs (usually a bottom split).  However, if this is set to &rsquo;t&rsquo; (true), then the fallback position will be centered in the window.

    (setq ivy-posframe-display-functions-alist
          '((swiper                     . ivy-posframe-display-at-point)
            (complete-symbol            . ivy-posframe-display-at-point)
            ;; (counsel-M-x                . ivy-display-function-fallback)
            (counsel-esh-history        . ivy-posframe-display-at-window-center)
            (counsel-describe-function  . ivy-display-function-fallback)
            (counsel-describe-variable  . ivy-display-function-fallback)
            (counsel-find-file          . ivy-display-function-fallback)
            (counsel-recentf            . ivy-display-function-fallback)
            (counsel-register           . ivy-posframe-display-at-frame-bottom-window-center)
            (dmenu                      . ivy-posframe-display-at-frame-top-center)
            (nil                        . ivy-posframe-display))
          ivy-posframe-height-alist
          '((swiper . 20)
            (dmenu . 20)
            (t . 10)))
    (ivy-posframe-mode 1) ; 1 enables posframe-mode, 0 disables it.


<a id="orga73087c"></a>

## IVY KEYBINDINGS

By default, Doom Emacs does not use &rsquo;SPC v&rsquo;, so the format I use for these bindings is &rsquo;SPC v&rsquo; plus &rsquo;key&rsquo;.

    (map! :leader
          (:prefix ("v" . "Ivy")
           :desc "Ivy push view" "v p" #'ivy-push-view
           :desc "Ivy switch view" "v s" #'ivy-switch-view))


<a id="orgedebe54"></a>

# EVIL MODE


<a id="org7097b23"></a>

## INSERT

noob mode

    (after! evil
      (define-key evil-insert-state-map (kbd "C-v") 'yank)
      (define-key evil-insert-state-map (kbd "C-s") 'save-buffer)
      (define-key evil-insert-state-map (kbd "C-c") 'kill-ring-save)
      (define-key evil-insert-state-map (kbd "C-x") 'kill-region)
      (define-key evil-insert-state-map (kbd "C-z") 'undo)
      (define-key evil-insert-state-map (kbd "C-y") 'redo))
