.config/doom/config.org
** Keybinds
#+begin_src emacs-lisp
(map! :leader
      (:prefix ("d" . "dired")
       :desc "Open dired" "d" #'dired
       :desc "Dired jump to current" "j" #'dired-jump)
       ;; :desc "Dired split jump" "J" #'dired-jump)
      (:after dired
       (:map dired-mode-map
        :desc "Peep-dired image previews" "d p" #'peep-dired ;; HALF WORKING
        :desc "Dired view file"           "d v" #'dired-view-file)))
#+end_src
** Condifuration
#+begin_src emacs-lisp
(evil-define-key 'normal dired-mode-map
  (kbd "<escape>") 'delete-frame
  (kbd "M-RET") 'dired-display-file
  (kbd "h") 'dired-up-directory
  (kbd "l") 'dired-open-file ; use dired-find-file instead of dired-open.
  (kbd "m") 'dired-mark
  (kbd "t") 'dired-toggle-marks
  (kbd "u") 'dired-unmark
  (kbd "C") 'dired-do-copy
  (kbd "J") 'dired-goto-file
  (kbd "M") 'dired-do-chmod
  (kbd "O") 'dired-do-chown
  (kbd "P") 'dired-do-print
  (kbd "R") 'dired-do-rename
  (kbd "r") 'laluxx/dired-run-or-find
  (kbd "T") 'dired-do-touch
  (kbd "Y") 'dired-copy-filenamecopy-filename-as-kill ; copies filename to kill ring.
  (kbd "Z") 'dired-do-compress
  ;; (kbd "D") 'dired-do-delete
  (kbd "D") 'dired-create-directory
  (kbd "-") 'dired-do-kill-lines
  (kbd "% l") 'dired-downcase
  (kbd "% m") 'dired-mark-files-regexp
  (kbd "% u") 'dired-upcase
  (kbd "* %") 'dired-mark-files-regexp
  (kbd "* .") 'dired-mark-extension
  (kbd "* /") 'dired-mark-directories
  (kbd "; d") 'epa-dired-do-decrypt
  (kbd "; e") 'epa-dired-do-encrypt)
;; Get file icons in dired
(add-hook 'dired-mode-hook 'all-the-icons-dired-mode)
;; With dired-open plugin, you can launch external programs for certain extensions
;; For example, I set all .png files to open in 'sxiv' and all .mp4 files to open in 'mpv'
(setq dired-open-extensions '(("gif" . "sxiv")
                              ("jpg" . "sxiv")
                              ("png" . "sxiv")
                              ("mkv" . "mpv")
                              ("mp4" . "mpv")))
#+end_src
** Custom faces
#+begin_src emacs-lisp
;; (custom-set-faces
;;   '(dired-header ((t (:family "JetBrains Mono NF ExtraBold" :height 120))))
;;   '(dired-directory ((t (:family "JetBrains Mono NF ExtraBold" :height 120)))))
#+end_src
** Run
#+begin_src emacs-lisp
(setq async-shell-command-buffer 'rename-buffer)

(defun laluxx/dired-run-or-find ()
  "In Dired, run a script if it's a script, enter directory if it's a directory, or open the file otherwise."
  (interactive)
  (let ((file (dired-get-file-for-visit)))
    (cond
     ((file-directory-p file) (dired-find-file)) ; If it's a directory, recurse into it
     ((and (file-exists-p file) (file-executable-p file)) ; If it's an executable file, run it and also open it
      (find-file file)
      (async-shell-command (concat "./" file " > /dev/null 2>&1 &")))
     ((and (file-exists-p file) (string-match-p "\\.py\\'" file)) ; If it's a Python script, run it and also open it
      (find-file file)
      (async-shell-command (concat "python " file " > /dev/null 2>&1 &")))
     ((file-exists-p file) (find-file file)) ; If it's another type of file, just open it
     (t (message "No file on this line")))))


#+end_src
** Keybindings Within Dired With Peep-Dired-Mode Enabled
If peep-dired is enabled, you will get image previews as you go up/down with 'j' and 'k'
#+BEGIN_SRC emacs-lisp
(evil-define-key 'normal peep-dired-mode-map
  (kbd "j") 'peep-dired-next-file
  (kbd "k") 'peep-dired-prev-file)
(add-hook 'peep-dired-hook 'evil-normalize-keymaps)
#+END_SRC
* SPACELINE
** Conf
#+begin_src emacs-lisp
(use-package spaceline-config
  :ensure spaceline
  :config
  (setq spaceline-buffer-encoding-abbrev-p nil
        spaceline-line-column-p nil
        spaceline-line-p nil
        spaceline-highlight-face-func 'spaceline-highlight-face-evil-state
        powerline-default-separator 'wave)

  (spaceline-define-segment evil-state
    "The current evil state.  Requires `evil-mode' to be enabled."
    (when (bound-and-true-p evil-local-mode)
      (s-trim (evil-state-property evil-state :tag t))))

  (spaceline-define-segment buffer-modified
    "Replace the `buffer-modified' segment with an exclamation point for
    modified buffers and an asterisk for read-only buffers."
    (cond (buffer-read-only "*")
          ((buffer-modified-p) "!")))

  (setq spaceline-left
        '((evil-state :face highlight-face)
          (buffer-modified :face error-face)
          anzu
          auto-compile
          ((buffer-id buffer-size) :separator " | ")
          major-mode
          ((flycheck-error flycheck-warning flycheck-info)
           :when active)
          (version-control :when active)
          (org-pomodoro :when active)
          (org-clock :when active)))

  (setq spaceline-right
        '((global :when active)
          buffer-position
          hud))

  (spaceline-spacemacs-theme))
#+end_src
** toggle-modeline
#+begin_src emacs-lisp
(defvar my-modeline-state 'spaceline)

(defun laluxx/toggle-modeline-local ()
  "Toggle between spaceline and no modeline for the current buffer."
  (interactive)
  (if (eq my-modeline-state 'spaceline)
      (progn
        (setq my-modeline-state 'none)
        (hide-mode-line-mode 1))
    (progn
      (hide-mode-line-mode -1)
      (setq my-modeline-state 'spaceline)
      (spaceline-spacemacs-theme))))

(defun laluxx/toggle-modeline-global ()
  "Toggle between spaceline and no modeline globally."
  (interactive)
  (if (eq my-modeline-state 'spaceline)
      (progn
        (setq my-modeline-state 'none)
        (global-hide-mode-line-mode 1))
    (progn
      (global-hide-mode-line-mode -1)
      (setq my-modeline-state 'spaceline)
      (spaceline-spacemacs-theme))))

(map! :leader
      (:prefix ("t" . "toggle")
       "m" #'laluxx/toggle-modeline-local
       "M" #'laluxx/toggle-modeline-global))


#+end_src

* RAINBOW MODE
turned on all the time, regardless of the mode.
The following creates a global minor mode for rainbow-mode and enables it (exception: org-agenda-mode since rainbow-mode destroys all highlighting in org-agenda).
#+begin_src emacs-lisp
(define-globalized-minor-mode global-rainbow-mode rainbow-mode
  (lambda ()
    (when (not (memq major-mode
                (list 'org-agenda-mode)))
     (rainbow-mode 1))))
(global-rainbow-mode 1 )
#+end_src
* Emacs-run
** Run-launcher
#+begin_src emacs-lisp
(defun emacs-run-launcher ()
  "Create and select a frame called emacs-run-launcher which consists only of a minibuffer and has specific dimensions. Runs app-launcher-run-app on that frame, which is an emacs command that prompts you to select an app and open it in a dmenu like behaviour. Delete the frame after that command has exited"
  (interactive)
  (with-selected-frame
    (make-frame '((name . "emacs-run-launcher")
                  (minibuffer . only)
                  (fullscreen . 0) ; no fullscreen
                  (undecorated . t) ; remove title bar
                  ;;(auto-raise . t) ; focus on this frame
                  ;;(tool-bar-lines . 0)
                  ;;(menu-bar-lines . 0)
                  (internal-border-width . 10)
                  (width . 80)
                  (height . 11)))
                  (unwind-protect
                    (app-launcher-run-app)
                    (delete-frame))))
#+end_src
** wal-set
