.config/doom/config.org
*** Default
#+begin_src emacs-lisp
(defun emacs-run-wal-set ()
  "Create and select a frame called emacs-run-launcher which consists only of a minibuffer and has specific dimensions. Runs app-launcher-run-app on that frame, which is an emacs command that prompts you to select an app and open it in a dmenu like behaviour. Delete the frame after that command has exited"
  (interactive)
  (with-selected-frame
    (make-frame '((name . "emacs-run-wal-set")
                  (minibuffer . only)
                  (fullscreen . 0) ; no fullscreen
                  (undecorated . t) ; remove title bar
                  ;;(auto-raise . t) ; focus on this frame
                  ;;(tool-bar-lines . 0)
                  ;;(menu-bar-lines . 0)
                  (internal-border-width . 10)
                  (width . 80)
                  (height . 11)))
                  (unwind-protect
                    (laluxx/wal-set)
                    (delete-frame))))
#+end_src
*** Solid
#+begin_src emacs-lisp
(defun emacs-run-wal-set-solid ()
  "Create and select a frame called emacs-run-launcher which consists only of a minibuffer and has specific dimensions. Runs app-launcher-run-app on that frame, which is an emacs command that prompts you to select an app and open it in a dmenu like behaviour. Delete the frame after that command has exited"
  (interactive)
  (with-selected-frame
    (make-frame '((name . "emacs-run-wal-set-solid")
                  (minibuffer . only)
                  (fullscreen . 0) ; no fullscreen
                  (undecorated . t) ; remove title bar
                  ;;(auto-raise . t) ; focus on this frame
                  ;;(tool-bar-lines . 0)
                  ;;(menu-bar-lines . 0)
                  (internal-border-width . 10)
                  (width . 80)
                  (height . 11)))
                  (unwind-protect
                    (laluxx/wal-set-solid)
                    (delete-frame))))
#+end_src
*** favourite
#+begin_src emacs-lisp
(defun emacs-run-wal-set-favourite ()
  "Create and select a frame called emacs-run-launcher which consists only of a minibuffer and has specific dimensions. Runs app-launcher-run-app on that frame, which is an emacs command that prompts you to select an app and open it in a dmenu like behaviour. Delete the frame after that command has exited"
  (interactive)
  (with-selected-frame
    (make-frame '((name . "emacs-run-wal-set-favourite")
                  (minibuffer . only)
                  (fullscreen . 0) ; no fullscreen
                  (undecorated . t) ; remove title bar
                  ;;(auto-raise . t) ; focus on this frame
                  ;;(tool-bar-lines . 0)
                  ;;(menu-bar-lines . 0)
                  (internal-border-width . 10)
                  (width . 80)
                  (height . 11)))
                  (unwind-protect
                    (laluxx/wal-set-favourite)
                    (delete-frame))))
#+end_src
*** Set-wallpaper
#+begin_src emacs-lisp
(defun emacs-run-set-wallpaper ()
  "Create and select a frame called emacs-run-launcher which consists only of a minibuffer and has specific dimensions. Runs app-launcher-run-app on that frame, which is an emacs command that prompts you to select an app and open it in a dmenu like behaviour. Delete the frame after that command has exited"
  (interactive)
  (with-selected-frame
    (make-frame '((name . "emacs-run-set-wallpaper")
                  (minibuffer . only)
                  (fullscreen . 0) ; no fullscreen
                  (undecorated . t) ; remove title bar
                  ;;(auto-raise . t) ; focus on this frame
                  ;;(tool-bar-lines . 0)
                  ;;(menu-bar-lines . 0)
                  (internal-border-width . 10)
                  (width . 80)
                  (height . 11)))
                  (unwind-protect
                    (laluxx/set-wallpaper)
                    (delete-frame))))
#+end_src
** M-X
#+begin_src emacs-lisp
(defun emacs-run-M-x ()
  "Create a new frame and prompt for an M-x command in it."
  (interactive)
  (with-selected-frame
      (make-frame '((name . "emacs-run-M-x")
                    (minibuffer . only)
                    (fullscreen . 0)
                    (undecorated . t)
                    (internal-border-width . 10)
                    (width . 80)
                    (height . 11)))
    (unwind-protect
        (call-interactively 'execute-extended-command)
      (delete-frame))))
#+end_src
** Info
Open info inside xmonad  DONE:
- remember last manual manual [x]
- Toggle [x]
#+begin_src emacs-lisp
(defvar emacs-run-info-frame nil)

(defun emacs-run-info ()
  "Create a new frame and run 'info' in it."
  (interactive)
  (if (and emacs-run-info-frame (frame-live-p emacs-run-info-frame))
      ;; If the frame exists, delete it.
      (progn
        (delete-frame emacs-run-info-frame)
        (setq emacs-run-info-frame nil))
    ;; Else, create a new frame.
    (let* ((new-frame (make-frame '((name . "emacs-run-info")
                                    (minibuffer . t)
                                    (fullscreen . 0)
                                    (undecorated . t)
                                    (internal-border-width . 10)
                                    (width . 80)
                                    (height . 11)))))
      (setq emacs-run-info-frame new-frame)
      (select-frame-set-input-focus new-frame)
      (with-selected-window (frame-selected-window new-frame)
        (switch-to-buffer (save-window-excursion
                            (info)
                            (current-buffer)))
        (delete-other-windows)
        (define-key Info-mode-map (kbd "<escape>") 'delete-frame)))))



#+end_src
** Which-key
#+begin_src emacs-lisp
;; (defun emacs-run-which-key ()
;;   "Create a new frame and prompt for a which-key command in it."
;;   (interactive)
;;   (let ((new-frame (make-frame '((name . "emacs-run-which-key")
;;                                  (minibuffer . only)
;;                                  (fullscreen . 0)
;;                                  (undecorated . t)
;;                                  (internal-border-width . 10)
;;                                  (width . 80)
;;                                  (height . 11)))))
;;     (with-selected-frame new-frame
;;       (which-key-mode 1)
;;       (call-interactively 'which-key-show-top-level))))
#+end_src
** Dired
TODO
- esc don't close the frame [x]
- hide modeline [x]

#+begin_src emacs-lisp
(defun hide-mode-line-in-dired-frame (frame)
  "Hide the mode line in the 'emacs-run-dired' frame."
  (when (string-equal (frame-parameter frame 'name) "emacs-run-dired")
    (with-selected-frame frame
      (setq-default mode-line-format nil))))

(add-hook 'after-make-frame-functions 'hide-mode-line-in-dired-frame)

(defun emacs-run-dired ()
  "Create a new frame and open dired in it."
  (interactive)
  (let* ((original-frame (selected-frame))
         (new-frame (make-frame '((name . "emacs-run-dired")
                                  (width . 80)
                                  (height . 24)
                                  (minibuffer . t)
                                  (undecorated . t)
                                  (internal-border-width . 10)
                                  (fullscreen . 0)))))
    (select-frame-set-input-focus new-frame)
    (with-selected-window (frame-selected-window new-frame)
      (dired "~"))  ;; opens dired in your home directory, change "~" to any directory you prefer
    (define-key dired-mode-map (kbd "<escape>") 'delete-frame)
    (select-frame-set-input-focus original-frame)))
#+end_src
