.config/doom/config.md


<a id="org64529fb"></a>

## Clone-client-frame

    (defun hide-mode-line-in-frame (frame)
      "Hide the mode line in the specified frames."
      (when (string-match-p "^emacs-run-clone-client-frame" (frame-parameter frame 'name))
        (with-selected-frame frame
          (setq mode-line-format nil))))
    
    (add-hook 'after-make-frame-functions 'hide-mode-line-in-frame)
    
    (defun emacs-run-clone-client-frame ()
      "Create a new frame and activate which-key-mode in it."
      (interactive)
      (let ((new-frame (make-frame '((name . "emacs-run-clone-client-frame")
                                     (minibuffer . nil)
                                     (fullscreen . 0)
                                     (undecorated . t)
                                     (internal-border-width . 10)
                                     (width . 80)
                                     (height . 11)))))
        (with-selected-frame new-frame
          (which-key-mode 1)
          (minibuffer-keyboard-quit))))
    
    (defun emacs-run-clone-client-frame-bottom ()
      "Create a new frame and activate which-key-mode in it."
      (interactive)
      (let ((new-frame (make-frame '((name . "emacs-run-clone-client-frame-bottom")
                                     (minibuffer . nil)
                                     (fullscreen . 0)
                                     (undecorated . t)
                                     (internal-border-width . 10)
                                     (width . 80)
                                     (height . 11)))))
        (with-selected-frame new-frame
          (which-key-mode 1)
          (minibuffer-keyboard-quit))))


<a id="orga6b7169"></a>

### Dmenu

    (defun emacs-run-dmenu ()
      "Create a new frame and run dmenu in it."
      (interactive)
      (with-selected-frame
          (make-frame '((name . "emacs-run-dmenu")
                        (minibuffer . only)
                        (fullscreen . 0)
                        (undecorated . t)
                        (internal-border-width . 10)
                        (width . 80)
                        (height . 11)))
        (unwind-protect
            (call-interactively 'dmenu)
          (delete-frame))))


<a id="org0194b7d"></a>

# Config


<a id="org28d936c"></a>

## Evil

    (after! evil
      (map! :after evil
            :map evil-insert-state-map
            "C-h" #'evil-backward-char
            "C-j" #'evil-next-line
            "C-k" #'evil-previous-line
            "C-l" #'evil-forward-char))


<a id="org41d0ab8"></a>

## org-auto-tangle

`org-auto-tangle` allows you to add the option `#+auto_tangle: t` in your Org file so that it automatically tangles when you save the document.

    (use-package! org-auto-tangle
      :defer t
      :hook (org-mode . org-auto-tangle-mode)
      :config
      (setq org-auto-tangle-default t))
    
    (defun laluxx/insert-auto-tangle-tag ()
      "Insert auto-tangle tag in a literate config."
      (interactive)
      (evil-org-open-below 1)
      (insert "#+auto_tangle: t ")
      (evil-force-normal-state))
    
    (map! :leader
          :desc "Insert auto_tangle tag" "i a" #'laluxx/insert-auto-tangle-tag)


<a id="org57f3c9e"></a>

## Centaur-tabs

    (after! centaur-tabs
      (setq centaur-tabs-style "rounded"
            centaur-tabs-height 32
            centaur-tabs-set-icons t
            centaur-tabs-set-bar 'under
            x-underline-at-descent-line t
            centaur-tabs-set-modified-marker t
            centaur-tabs-show-navigation-buttons t
            centaur-tabs-show-new-tab-button t
            centaur-tabs-left-edge-margin nil
            centaur-tabs-cycle-scope 'tabs)
      (centaur-tabs-mode t)
      (centaur-tabs-headline-match)
      (setq centaur-tabs-adjust-buffer-order t))
    
    
    
    (defun my/centaur-tabs-mode-condition ()
      (if (or (> (count-windows) 1)
              (derived-mode-p 'dashboard-mode 'vterm-mode 'dired-mode))
          (centaur-tabs-local-mode)  ;; disable if more than one window or in one of the listed modes
        (centaur-tabs-local-mode -1)))  ;; enable otherwise
    
    
    ;; Run the function after every buffer list update
    (add-hook 'buffer-list-update-hook 'my/centaur-tabs-mode-condition)


<a id="orgea9faf7"></a>

## Vterm

    ;; (add-hook 'vterm-mode-hook
    ;;           (lambda ()
    ;;             (define-key vterm-mode-map (kbd "C-j") 'other-window)
    ;;             (define-key vterm-mode-map (kbd "C-k")
    ;;               (lambda ()
    ;;                 (interactive)
    ;;                 (other-window -1)))
    ;;             (define-key vterm-mode-map (kbd "C-h") 'neotree-or-enlarge-window-left)
    ;;             (define-key vterm-mode-map (kbd "C-l") 're-builder-or-enlarge-window-right)
    ;;             (define-key vterm-mode-map (kbd "C-M-j") 'rotate-window)
    ;;             (define-key vterm-mode-map (kbd "C-M-k")
    ;;               (lambda ()
    ;;                 (interactive)
    ;;                 (dotimes (_ (- (length (window-list)) 1))
    ;;                   (rotate-window))))
    ;;             (evil-define-key 'normal vterm-mode-map (kbd "q") 'delete-window)))
    
    (add-hook 'vterm-mode-hook
              (lambda ()
                (evil-define-key 'insert vterm-mode-map (kbd "C-j") 'other-window)
                (evil-define-key 'insert vterm-mode-map (kbd "C-k")
                  (lambda ()
                    (interactive)
                    (other-window -1)))
                (evil-define-key 'insert vterm-mode-map (kbd "C-h") 'neotree-or-enlarge-window-left)
                (evil-define-key 'insert vterm-mode-map (kbd "C-l") 're-builder-or-enlarge-window-right)
                (evil-define-key 'insert vterm-mode-map (kbd "C-M-j") 'rotate-window)
                (evil-define-key 'insert vterm-mode-map (kbd "C-M-k")
                  (lambda ()
                    (interactive)
                    (dotimes (_ (- (length (window-list)) 1))
                      (rotate-window))))
                (evil-define-key 'normal vterm-mode-map (kbd "q") 'delete-window)))


<a id="org1d04337"></a>

## Magit

    ;; (with-eval-after-load 'magit
    ;;   (define-key magit-mode-map (kbd "C-j") #'other-window)
    ;;   (define-key magit-mode-map (kbd "C-k") (lambda () (interactive) (other-window -1)))
    ;;   (define-key magit-mode-map (kbd "M-j") #'magit-section-forward)
    ;;   (define-key magit-mode-map (kbd "M-k") #'magit-section-backward))
    
    (after! magit
      (define-key magit-mode-map (kbd "C-j") #'other-window)
      (define-key magit-mode-map (kbd "C-k") (lambda () (interactive) (other-window -1)))
      (define-key magit-mode-map (kbd "M-j") #'magit-section-forward)
      (define-key magit-mode-map (kbd "M-k") #'magit-section-backward))


<a id="org28ba692"></a>

## Neotree

    (after! neotree
      (map! :map neotree-mode-map
            :n "C-j" #'my-switch-buffer-forward-or-other-window
            :n "C-k" #'my-switch-buffer-backward-or-other-window
            :n "C-h" #'neotree-hide))


<a id="org8c260d8"></a>

## Ewal


<a id="orgf846d86"></a>

### Default

    (use-package! ewal
      :init
      (setq ewal-use-built-in-always-p nil
            ewal-use-built-in-on-failure-p t
            ewal-built-in-palette "sexy-material"))


<a id="org6dc7bda"></a>

### Ewal-Doom-Theme

this will set the theme

    (use-package! ewal-doom-themes
      :init
      ;; If you've set ewal-use-built-in-always-p to nil in ewal configuration
      ;; This might be unnecessary, but doesn't hurt to ensure.
      (setq ewal-use-built-in-always-p nil
            ewal-use-built-in-on-failure-p t
            ewal-built-in-palette "sexy-material")
      :config
      (load-theme 'ewal-doom-one t)
      (enable-theme 'ewal-doom-one))


<a id="org2e38699"></a>

# Enable

    ;; (desktop-save-mode 1)
