.config/doom/config.md


<a id="org6e71fc5"></a>

# Images

    ;; (global-set-key [double-mouse-1] 'my-open-image-at-point-in-new-buffer)
    
    ;; (defun my-open-image-at-point-in-new-buffer (event)
    ;;   "Open the image at point in a new buffer."
    ;;   (interactive "e")
    ;;   (let* ((window (posn-window (event-end event)))
    ;;          (buffer (window-buffer window))
    ;;          (pos (posn-point (event-end event)))
    ;;          (file (with-current-buffer buffer
    ;;                  (get-text-property pos 'display))))
    ;;     (when file
    ;;       (let ((buffer (generate-new-buffer "image-buffer")))
    ;;         (switch-to-buffer buffer)
    ;;         (insert-file-contents (car file))
    ;;         (image-mode)))))
    
    ;; (global-set-key [double-mouse-1] 'my-open-image-at-point-in-new-buffer)
    
    
    (require 'ffap)
    
    (defun doom/open-file-at-point-in-new-buffer (event)
      "Open the file under the mouse cursor in a new buffer."
      (interactive "e")
      (let* ((window (posn-window (event-end event)))
             (buffer (window-buffer window))
             (pos (posn-point (event-end event)))
             (file (with-current-buffer buffer
                     (ffap-file-at-point))))
        (when file
          (let ((buf (find-file-noselect file)))
            (with-current-buffer buf
              (when (member (file-name-extension file)
                            '("jpg" "jpeg" "png" "gif" "bmp"))
                (image-mode)))
            (switch-to-buffer-other-window buf)))))
    
    (global-set-key [double-mouse-1] #'doom/open-file-at-point-in-new-buffer)

